app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    logger.debug "Session Resetted..." if reset_session
    @user = User.new
    @users = User.all

INSERT INTO "users" ("created_at", "crypted_password", "email", "password_salt", "persistence_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    flash[:notice] = params.inspect
    begin
      if @user.save